cask_args appdir: "/Applications"

# Taps
tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/services"

# Brew
brew "cloc"
brew "go"
brew "gh"
brew "hugo"
brew "mysql"
brew "neovim"
brew "node"
brew "pandoc"
brew "pnpm"
brew "tmux"
brew "webp"
brew "wget"

# Apps
cask "alfred"
cask "clashx"
cask "iterm2"
cask "qingg"
cask "visual-studio-code"
cask "the-unarchiver"
cask "qq"
cask "wechat"
cask "postman"
cask "iina"


