cask_args appdir: '/Applications'

brew 'mas'
brew 'wget'
brew 'node'
brew 'yarn'
brew 'tmux'
brew 'neovim'
brew 'aria2'
brew 'm-cli'
brew 'go'
brew 'emacs', args: ['with-cocoa','srgb']

cask 'alfred'
cask 'iterm2'
cask 'google-chrome'
cask 'qq'
cask 'iina'
cask 'visual-studio-code'
cask 'shadowsocksx-ng'
cask 'sketch'
cask 'the-unarchiver'
cask 'postman'
cask 'qingg'
cask 'docker'
cask 'dropbox'
case 'principle'

cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'betterzip'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'qlvideo'

# mas 'Xcode', id: 497799835
mas 'WeChat', id: 836500024
# mas 'Pages', id: 409201541
# mas 'Numbers', id: 409203825
