cask_args appdir: '/Applications'

brew 'mas'
brew 'wget'
brew 'node'
brew 'yarn'
brew 'tmux'

cask 'alfred'
cask 'iterm2'
cask 'google-chrome'
cask 'qq'
cask 'iina'
cask 'visual-studio-code'
cask 'shadowsocksx-ng'
cask 'sketch'
cask 'the-unarchiver'
cask 'postman'
cask 'foxmail'
cask 'qingg'
cask 'teamviewer'

cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlimagesize'
cask 'webpquicklook'

mas 'Xcode', id: 497799835
mas 'WeChat', id: 836500024
mas 'Pages', id: 409201541
mas 'Numbers', id: 409203825
