cask_args appdir: "/Applications"

# Taps
tap "homebrew/bundle"
tap "homebrew/services"

# Formulae
brew "cloc"
brew "gh"
brew "neovim"
brew "node"
brew "pnpm"
brew "tmux"
brew "wget"
brew "ripgrep"
brew "lua-language-server"

# Apps
cask "alfred"
cask "alacritty"
cask "qingg"
cask "visual-studio-code"
cask "google-chrome"
cask "qq"
cask "wechat"
cask "iina"
cask "synology-drive"

# Fonts
cask "font-sf-mono"
cask "font-symbols-only-nerd-font"
cask "font-jetbrains-mono-nerd-font"

# VSCode
vscode "EditorConfig.EditorConfig"
vscode "GitHub.github-vscode-theme"
vscode "PKief.material-icon-theme"
