cask_args appdir: "/Applications"

# Taps
tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/services"
tap "epk/epk"

#
brew "wget"
brew "node"
brew "yarn"
brew "mas"
brew "tmux"
brew "dockutil"
brew "cloc"
brew "webp"
brew "go"
brew "fzf"
brew "ripgrep"
brew "postgresql"
brew "aria2"
brew "youtube-dl"

# Apps
cask "sf-symbols"
cask "alfred"
cask "iterm2"
cask "iina"
cask "qingg"
cask "visual-studio-code"
cask "the-unarchiver"
cask "onedrive"
cask "postico"
cask "emacs"
cask "google-chrome"

# Fonts
cask "font-sf-mono-nerd-font"

# Quicklook
cask "qlcolorcode"
cask "qlmarkdown"
cask "quicklook-json"
cask "qlimagesize"
cask "webpquicklook"

# macOS App Store
mas "WeChat",    id: 836500024
mas "QQ",        id: 451108668
mas 'Numbers',   id: 409203825
mas "Keynote",   id: 409183694
